In [2]:
# Q1. Create a Pandas Series that contains the following data: 4, 8, 15, 16, 23, and 42. Then, print the series.
import pandas as pd
pd.Series([4,8,15,16,23,42])

0     4
1     8
2    15
3    16
4    23
5    42
dtype: int64

In [5]:
import numpy as np
arr = np.array([4,8,15,16,23,42])
pd.Series(arr)

0     4
1     8
2    15
3    16
4    23
5    42
dtype: int32

In [7]:
#  using dict
data = {
    0:4,1:8,2:15,3:16,4:23,5:42
}
pd.Series(data)

0     4
1     8
2    15
3    16
4    23
5    42
dtype: int64

In [8]:
# Create a variable of list type containing 10 elements in it, and apply pandas.Series function on the
# variable print it.
my_list = [2,1,3,4,5,6,7,8,9,10]
pd.Series(my_list)

0     2
1     1
2     3
3     4
4     5
5     6
6     7
7     8
8     9
9    10
dtype: int64

In [14]:
# Create a Pandas DataFrame that contains the following data:
data = {
    "Name" : ["Alice", "Bob", "claire"],
    "Age"  : [25, 30, 27],
    "Gender" : ["Female", "Male", "Female"]
}
pd.DataFrame(data).set_index(["Name","Age", "Gender"])

Empty DataFrame
Columns: []
Index: [(Alice, 25, Female), (Bob, 30, Male), (claire, 27, Female)]

In [21]:
# What is ‘DataFrame’ in pandas and how is it different from pandas.series? Explain with an example.

# pd.DataFrame = In Pandas, a DataFrame is a two-dimensional tabular data structure with labeled axes (rows and columns) that can hold data of different types.
# It is similar to a spreadsheet or SQL table and is one of the most commonly used data structures in Pandas.

# ps.Series = Pandas Series is a one-dimensional labeled array that can hold data of various types, including integer, float, string, etc.
# It can be thought of as a single column of data in a DataFrame.
data1 = {'Name': ['John', 'Jane', 'Jim', 'Joan'],
        'Age': [25, 30, 35, 40],
        'Occupation': ['Engineer', 'Doctor', 'Teacher', 'Lawyer']}

# Create a DataFrame from the dictionary
df1 = pd.DataFrame(data1)

# Create a Series from the 'Age' column of the DataFrame
age_series = df1['Age']

# Print the DataFrame and Series
print(df1)
print(age_series)

   Name  Age Occupation
0  John   25   Engineer
1  Jane   30     Doctor
2   Jim   35    Teacher
3  Joan   40     Lawyer
0    25
1    30
2    35
3    40
Name: Age, dtype: int64

In [22]:
df1['Age']

0    25
1    30
2    35
3    40
Name: Age, dtype: int64

In [23]:
type(df1['Age'])

pandas.core.series.Series

In [24]:
df1[['Name', 'Age']]

   Name  Age
0  John   25
1  Jane   30
2   Jim   35
3  Joan   40

In [25]:
type(df1[['Name', 'Age']])

pandas.core.frame.DataFrame

In [28]:
# What are some common functions you can use to manipulate data in a Pandas DataFrame? Can
# you give an example of when you might use one of these functions?
data3 = {'Name': ['John', 'Jane', 'Jim', 'Joan'],
        'Age': [25, 30, 35, 40],
        'Occupation': ['Engineer', 'Doctor', 'Teacher', 'Lawyer'],
        'Salary': [50000, 80000, 60000, 90000],
        'Category': ['A', 'B', 'A', 'B'],
        'Region': ['North', 'South', 'East', 'West']}
df3 = pd.DataFrame(data3)
df3

   Name  Age Occupation  Salary Category Region
0  John   25   Engineer   50000        A  North
1  Jane   30     Doctor   80000        B  South
2   Jim   35    Teacher   60000        A   East
3  Joan   40     Lawyer   90000        B   West

In [30]:
#  view the first few rows of the DataFrame
# By default 5 rows
df3.head(2)

   Name  Age Occupation  Salary Category Region
0  John   25   Engineer   50000        A  North
1  Jane   30     Doctor   80000        B  South

In [32]:
# # view the first last rows of the DataFrame
# By default last 5
df3.tail(2)

   Name  Age Occupation  Salary Category Region
2   Jim   35    Teacher   60000        A   East
3  Joan   40     Lawyer   90000        B   West

In [33]:
#  generate summary statistics for the numerical columns
df3.describe()

             Age        Salary
count   4.000000      4.000000
mean   32.500000  70000.000000
std     6.454972  18257.418584
min    25.000000  50000.000000
25%    28.750000  57500.000000
50%    32.500000  70000.000000
75%    36.250000  82500.000000
max    40.000000  90000.000000

In [34]:
# remove all rows with missing data
df3.dropna()

   Name  Age Occupation  Salary Category Region
0  John   25   Engineer   50000        A  North
1  Jane   30     Doctor   80000        B  South
2   Jim   35    Teacher   60000        A   East
3  Joan   40     Lawyer   90000        B   West

In [35]:
df3

   Name  Age Occupation  Salary Category Region
0  John   25   Engineer   50000        A  North
1  Jane   30     Doctor   80000        B  South
2   Jim   35    Teacher   60000        A   East
3  Joan   40     Lawyer   90000        B   West

In [36]:
#  replace all missing values with zeros
df3.fillna(0)

   Name  Age Occupation  Salary Category Region
0  John   25   Engineer   50000        A  North
1  Jane   30     Doctor   80000        B  South
2   Jim   35    Teacher   60000        A   East
3  Joan   40     Lawyer   90000        B   West

In [37]:
# sort the DataFrame by descending order of salary
df3.sort_values('Salary', ascending=False)

   Name  Age Occupation  Salary Category Region
3  Joan   40     Lawyer   90000        B   West
1  Jane   30     Doctor   80000        B  South
2   Jim   35    Teacher   60000        A   East
0  John   25   Engineer   50000        A  North

In [38]:
df3

   Name  Age Occupation  Salary Category Region
0  John   25   Engineer   50000        A  North
1  Jane   30     Doctor   80000        B  South
2   Jim   35    Teacher   60000        A   East
3  Joan   40     Lawyer   90000        B   West

In [39]:
#  create a pivot table that shows the total sales for each category and region
pivot = pd.pivot_table(df3, index='Category', columns='Region', values='Salary', aggfunc='sum')
print(pivot)

Region       East    North    South     West
Category
A         60000.0  50000.0      NaN      NaN
B             NaN      NaN  80000.0  90000.0

In [40]:
# Q6. Which of the following is mutable in nature Series, DataFrame, Panel?
# The Series and DataFrame objects in Pandas are mutable in nature, while the Panel object is not mutable.
# This means that you can modify the data in a Series or DataFrame after it has been created, but you cannot modify the data in a Panel after it has been created.

In [42]:
# Q7 Create a DataFrame using multiple Series. Explain with an example.
names = pd.Series(['John', 'Jane', 'Jim', 'Joan'])
ages = pd.Series([25,30,35,40])
occupations = pd.Series(['Engineer', 'Doctor', 'Teacher', 'Lawyer'])
data = {
    'Name':names, 'Age' : "ages", 'occupation':occupations
}
df5 = pd.DataFrame(data)

In [43]:
df5

   Name   Age occupation
0  John  ages   Engineer
1  Jane  ages     Doctor
2   Jim  ages    Teacher
3  Joan  ages     Lawyer